II/A_prescription/A_identity_linear/tutorial/cylinder/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1;
nu_p		[0 2 -1 0 0 0 0] 1;  //viscosidade dinâmica do polímero / rho_solvente
lambda		[0 0  1 0 0 0 0] 0.333; //tempo de relaxação
nu_stab		[0 2 -1 0 0 0 0] 150;
L2_               [0 0 0 0 0 0 0] 144;

// ************************************************************************* //
